mtosi1.1-TestSuite/TestsDefinitions/EquipmentInventoryMgr/examples/EquipmentInventoryMgr_getAllSupportedPTPNames.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ..\..\..\..\xsd\common\Header.xsd tmf854.v1 ..\..\..\..\xsd\interfaces\EquipmentInventoryMgr.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getAllSupportedPTPNames</activityName>
			<msgName>getAllSupportedPTPNames</msgName>
			<msgType>REQUEST</msgType>
			<correlationId>0001</correlationId>
			<senderURI>/MTOSI/InventoryOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>MultipleBatchResponse</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<requestedBatchSize>0</requestedBatchSize>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getAllSupportedPTPNames tmf854Version="1.1">
			<equipmentName>
				<mdNm>Networks/XdrEMS/Server1</mdNm>
				<meNm>19968  </meNm>
				<ehNm>/shelf=2/slot=3</ehNm>
				<eqNm>1</eqNm>
			</equipmentName>
		</getAllSupportedPTPNames>
	</soap:Body>
</soap:Envelope>
